Repository: GeopJr/metadata-cleaner
Catalog: help/*/*.po
Languages: pl, sl

source: Metadata and privacy
pl: Metadane i prywatność
sl: Metapodatki in zasebnost

source: Metadata consists of information that characterizes data. Metadata is used to provide documentation for data products. In essence, metadata answers who, what, when, where, why, and how about every facet of the data that is being documented.
pl: Metadane składają się z informacji charakteryzujących dane. Metadane służą do dostarczania dokumentacji produktów z danymi. Zasadniczo metadane odpowiadają na pytania: kto, co, kiedy, gdzie, dlaczego i jak w odniesieniu do każdego aspektu dokumentowanych danych.
sl: Metapodatki so sestavljeni iz informacij, ki označujejo podatke. Metapodatki se uporabljajo za zagotavljanje dokumentacije za podatkovne izdelke. V bistvu metapodatki odgovarjajo na vprašanje, kdo, kaj, kdaj, kje, zakaj in kako glede vsakega podatka, ki se dokumentira.

source: Metadata within a file can tell a lot about you. Cameras record data about when and where a picture was taken and which camera was used. Office applications automatically add author and company information to documents and spreadsheets. This is sensitive information and you may not want to disclose it.
pl: Metadane w pliku mogą wiele o tobie powiedzieć. Aparaty fotograficzne zapisują dane o tym, kiedy i gdzie zostało wykonane zdjęcie oraz który aparat został użyty. Aplikacje biurowe automatycznie dodają informacje o autorze i firmie do dokumentów i arkuszy kalkulacyjnych. Są to informacje wrażliwe i możesz nie chcieć ich ujawniać.
sl: Metapodatki v datotekah lahko povedo veliko o vas. Kamere beležijo podatke o tem, kdaj in kje je bila slika posneta ter kateri fotoaparat je bil uporabljen. Pisarniške aplikacije v dokumente in preglednice samodejno dodajo podatke o avtorju in podjetju. To so občutljivi podatki in jih morda ne boste želeli razkriti.

source: Example of metadata in a picture file
pl: Przykład metadanych w pliku obrazu
sl: Primer metapodatkov v slikovni datoteki

source: The file discloses information about the hardware, settings, date, location of the shoot. It contains a total of 79 metadata.
pl: W pliku znajdują się informacje o sprzęcie, ustawieniach, dacie i miejscu realizacji zdjęć. Zawiera łącznie 79 metadanych.
sl: Datoteka razkriva podatke o strojni opremi (fotoaparatu ali kameri), nastavitvah fotoaparata, datumu, lokaciji snemanja. Skupaj vsebuje 79 metapodatkov.

source: Cleaning process
pl: Proces czyszczenia
sl: Proces čiščenja

source: While <app>Metadata Cleaner</app> is doing its very best to display metadata, it doesn't mean that a file is clean from metadata if it doesn't show any. There is no reliable way to detect every single possible metadata for complex file formats. This is why you shouldn't rely on metadata's presence to decide if your file must be cleaned or not.
pl: Chociaż <app>Czyściciel Metadanych</app> robi wszystko, co w jego mocy, aby wyświetlić metadane, nie oznacza to, że plik jest wolny od metadanych, jeśli ich nie wyświetla. Nie ma niezawodnego sposobu na wykrycie wszystkich możliwych metadanych w przypadku złożonych formatów plików. Dlatego nie powinno się polegać na obecności metadanych przy podejmowaniu decyzji, czy plik wymaga wyczyszczenia, czy nie.
sl: Čeprav aplikacija <app>Metadata Cleaner</app> po svojih najboljših močeh trudi identificirati metapodatke v datotekah, to žal ne pomeni, da datoteka metapodatkov ne vsebuje, če niso prikazani. Za odkrivanje vseh možnih metapodatkov za kompleksne formate datotek žal ni zanesljivega načina. Zato se pri odločitvi, ali je treba vašo datoteko očistiti ali ne, ne bi smeli zanašati na to, ali je aplikacija uspela zaznati metapodatke.

source: <app>Metadata Cleaner</app> takes the content of the file and puts it into a new one without metadata, ensuring that any undetected metadata is stripped.
pl: <app>Czyściciel Metadanych</app> pobiera zawartość pliku i umieszcza ją w nowym pliku bez metadanych, zapewniając usunięcie wszelkich niewykrytych metadanych.
sl: <app>Metadata Cleaner</app> vzame vsebino datoteke in jo prekopira v novo datoteko brez metapodatkov, s čimer zagotovi, da so vsi nezaznani metapodatki odstranjeni.

source: Limitations
pl: Ograniczenia
sl: Omejive

source: Be aware that metadata is not the only way of marking a file. If the content itself discloses personal information or has been watermarked, traditionally or via steganography, <app>Metadata Cleaner</app> will not protect you.
pl: Należy pamiętać, że metadane nie są jedynym sposobem oznaczania pliku. Jeśli sama treść ujawnia dane osobowe lub została oznaczona znakiem wodnym, tradycyjnie lub za pomocą steganografii, <app>Czyściciel Metadanych</app> nie zapewni Ci ochrony.
sl: Zavedajte se, da metapodatki niso edini način označevanja datotek. Če že vsebina sama razkriva osebne podatke ali je bila datoteka označena z vodnim žigom (tradicionalno ali s pomočjo steganografije), vas <app>Metadata Cleaner</app> ne bo zaščitil.

source: Metadata Cleaner
pl: Czyściciel Metadanych
sl: Čistilec metapodatkov

source: <app>Metadata Cleaner</app> allows you to view metadata in your files and to get rid of it, as much as possible.
pl: <app>Czyściciel Metadanych</app> umożliwia przeglądanie metadanych w Twoich plikach i pozbycie się ich w miarę możliwości.
sl: <app>Metadata Cleaner</app> omogoča identifikacijo in pregled metapodatkov ter njihovo čiščenje v največji možni meri.

source: General information
pl: Informacje ogólne
sl: Splošne informacije

source: Using <app>Metadata Cleaner</app>
pl: Korzystanie z <app>Czyściciel Metadanych</app>
sl: Uporaba aplikacije <app>Metadata Cleaner</app>

source: Adding files
pl: Dodawania plików
sl: Dodajanje datotek

source: To add files, press the <gui style="button">Add Files</gui> button. A file chooser will open, select the files you want to clean.
pl: Aby dodać pliki, naciśnij przycisk <gui style="button">Dodaj Pliki</gui>. Otworzy się okno wyboru plików, wybierz pliki, które chcesz wyczyścić.
sl: Če želite dodati datoteke, pritisnite gumb <gui style="button">Dodaj datoteke</gui>. Odpre se okno za izbor datotek, kjer lahko izberete datoteke, ki jih želite očistiti.

source: <gui style="button">Add Files</gui> button
pl: Przycisk <gui style="button">Dodaj Pliki</gui>
sl: Gumb <gui style="button">Dodaj datoteke</gui>

source: To add whole folders at once, press the <gui style="button">Add Folders</gui> button. A file chooser will open, select the folders you want to add. You can optionally choose to also add all files from all subfolders by checking the <gui style="checkbox">Add files from subfolders</gui> checkbox.
pl: Aby dodać całe foldery na raz, naciśnij przycisk <gui style="button">Dodaj Foldery</gui>. Otworzy się okno wyboru plików, wybierz foldery które chcesz dodać. Opcjonalnie możesz także dodać wszystkie pliki ze wszystkich podfolderów, zaznaczając pole wyboru <gui style="checkbox">Dodaj pliki z podfolderów</gui>.
sl: Če želite dodati celotne mape, pritisnite gumb <gui style="button">Dodaj mape</gui>. Odpre se okno za izbor datotek, kjer lahko izberete mape, ki jih želite dodati. Po želji lahko dodate tudi vse datoteke iz vseh podmap. To storite tako da označite potrditveno polje <gui style="checkbox">Dodaj datoteke iz podmap</gui>.

source: <gui style="button">Add Folders</gui> button
pl: Przycisk <gui style="button">Dodaj Foldery</gui>
sl: Gumb <gui style="button">Dodaj mape</gui>

source: Viewing metadata
pl: Przeglądanie metadanych
sl: Pregled metapodatkov

source: Click on a file in the list to open the detailed view. If it has metadata, it will be shown there.
pl: Kliknij na plik z listy, aby otworzyć widok szczegółowy. Jeśli zawiera metadane, zostaną tam pokazane.
sl: Kliknite na datoteko na seznamu, da odprete podroben pogled. Če ima datoteka metapodatke, se bodo prikazali.

source: Detailed view of the metadata
pl: Szczegółowy widok metadanych
sl: Podroben pregled metapodatkov

source: Cleaning files
pl: Czyszczenie plików
sl: Čiščenje datotek

source: To clean all the files in the window, press the <gui style="button">Clean</gui> button. The cleaning process may take some time to complete.
pl: Aby wyczyścić wszystkie pliki w oknie, naciśnij przycisk <gui style="button">Wyczyść</gui>. Proces czyszczenia może zająć trochę czasu.
sl: Če želite očistiti vse datoteke v oknu, pritisnite gumb <gui style="button">Očisti</gui>. Postopek čiščenja lahko traja nekaj časa.

source: <gui style="button">Clean</gui> button
pl: Przycisk <gui style="button">Wyczyść</gui>
sl: Gumb <gui style="button">Očisti</gui>

source: Lightweight cleaning
pl: Lekkie czyszczenie
sl: Lahko čiščenje

source: By default, the removal process might alter a bit the data of your files, in order to remove as much metadata as possible. For example, texts in PDF might not be selectable anymore, compressed images might get compressed again…
pl: Domyślnie proces usuwania może odrobinę zmienić pliki, aby usunąć jak najwięcej metadanych. Dla przykładu, zaznaczanie tekstu w plikach PDF może nie być już możliwe, skompresowane obrazy mogą zostać ponownie skompresowane…
sl: Privzeto postopek čiščenja lahko nekoliko spremeni podatke vaših datotek. Razlog za to je, da želimo odstraniti čim več metapodatkov. Na primer, besedil v PDF-ju morda ne bo več mogoče izbrati, stisnjene slike bodo morda znova stisnjene, itd…

source: The lightweight mode, while not as thorough, will not make destructive changes to your files.
pl: Tryb lekki, choć nie tak dokładny, nie spowoduje destrukcyjnych zmian w plikach.
sl: Lahki način čiščenja ni tako temeljit, vendar pa ne bo poškodoval vaših datotek.
